Tekla Open API Reference for Tekla Structures 2025
Arc.ArcMiddlePoint Property
 Gets the point located at the middle of the arc
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ArcMiddlePoint { get; }
Public ReadOnly Property ArcMiddlePoint As Point
	Get
Property Value
Type: Point
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace